In [2]:
import pandas as pd
import numpy as np

# pd.merge

In [20]:
df1 = pd.DataFrame({
    'lkey': ['foo', 'bar', 'baz', 'foo'], 
    'value': [1,2,3,5]
})
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [21]:
df2 = pd.DataFrame({
    'rkey': ['foo', 'bar', 'baz', 'foo'],
    'value': [5,6,7,8]
})
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [22]:
df1.merge(df2, how='cross')

   lkey  value_x rkey  value_y
0   foo        1  foo        5
1   foo        1  bar        6
2   foo        1  baz        7
3   foo        1  foo        8
4   bar        2  foo        5
5   bar        2  bar        6
6   bar        2  baz        7
7   bar        2  foo        8
8   baz        3  foo        5
9   baz        3  bar        6
10  baz        3  baz        7
11  baz        3  foo        8
12  foo        5  foo        5
13  foo        5  bar        6
14  foo        5  baz        7
15  foo        5  foo        8

In [23]:
df1.merge(df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [24]:
df1.merge(df2, left_on = 'lkey', right_on = 'rkey', 
         suffixes = ('_left', '_right'))

  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

In [25]:
df1 = pd.DataFrame(
    {
        'a': ['foo', 'bar'], 
        'b': [1,2]
    }
)
df1

     a  b
0  foo  1
1  bar  2

In [26]:
df2 = pd.DataFrame(
    {
        'a': ['foo', 'baz'], 
        'b': [3,4]
    }
)
df2

     a  b
0  foo  3
1  baz  4

In [27]:
df1.merge(df2, how='inner', on='a')

     a  b_x  b_y
0  foo    1    3

In [28]:
df1.merge(df2, how='left', on='a')

     a  b_x  b_y
0  foo    1  3.0
1  bar    2  NaN

In [29]:
df1 = pd.DataFrame({'left': ['foo', 'bar']})
df1

  left
0  foo
1  bar

In [30]:
df2 = pd.DataFrame({'right': [7,8]})
df2

   right
0      7
1      8

In [31]:
df1.merge(df2, how='cross')

  left  right
0  foo      7
1  foo      8
2  bar      7
3  bar      8

# pd.merge_ordered

In [32]:
df1 = pd.DataFrame({
    'key': ['a', 'c', 'e', 'a', 'c', 'e'], 
    'lvalue': [1,2,3,1,2,3], 
    'group': ['a', 'a', 'a', 'b', 'b', 'b']
})
df1

  key  lvalue group
0   a       1     a
1   c       2     a
2   e       3     a
3   a       1     b
4   c       2     b
5   e       3     b

In [33]:
df2 = pd.DataFrame({
    'key': ['b', 'c', 'd'], 
    'rvalue': [1,2,3]
})
df2

  key  rvalue
0   b       1
1   c       2
2   d       3

In [34]:
pd.merge_ordered(df1, df2, fill_method='ffill', left_by='group')

  key  lvalue group  rvalue
0   a       1     a     NaN
1   b       1     a     1.0
2   c       2     a     2.0
3   d       2     a     3.0
4   e       3     a     3.0
5   a       1     b     NaN
6   b       1     b     1.0
7   c       2     b     2.0
8   d       2     b     3.0
9   e       3     b     3.0

# pd.merge_asof

In [35]:
left = pd.DataFrame({
    'a': [1,5,10], 
    'left_val': ['a', 'b', 'c']
})
left

    a left_val
0   1        a
1   5        b
2  10        c

In [36]:
right = pd.DataFrame({
    'a': [1,2,3,6,7], 
    'right_val': [1,2,3,6,7]
})
right

   a  right_val
0  1          1
1  2          2
2  3          3
3  6          6
4  7          7

In [37]:
pd.merge_asof(left, right, on='a', allow_exact_matches=False)

    a left_val  right_val
0   1        a        NaN
1   5        b        3.0
2  10        c        7.0

In [38]:
pd.merge_asof(left, right, on='a', direction='forward')

    a left_val  right_val
0   1        a        1.0
1   5        b        6.0
2  10        c        NaN

In [39]:
pd.merge_asof(left, right, on='a', direction='nearest')

    a left_val  right_val
0   1        a          1
1   5        b          6
2  10        c          7

In [42]:
left = pd.DataFrame({
    'left_val': ['a', 'b','c'], 
}, index=[1,5,10])
left

   left_val
1         a
5         b
10        c

In [43]:
right= pd.DataFrame({'right_val': [1,2,3,6,7]}, index=[1,2,3,6,7])
right

   right_val
1          1
2          2
3          3
6          6
7          7

In [44]:
pd.merge_asof(left, right, left_index = True, right_index = True)

   left_val  right_val
1         a          1
5         b          3
10        c          7

In [45]:
quotes = pd.DataFrame(

    {

        "time": [

            pd.Timestamp("2016-05-25 13:30:00.023"),

            pd.Timestamp("2016-05-25 13:30:00.023"),

            pd.Timestamp("2016-05-25 13:30:00.030"),

            pd.Timestamp("2016-05-25 13:30:00.041"),

            pd.Timestamp("2016-05-25 13:30:00.048"),

            pd.Timestamp("2016-05-25 13:30:00.049"),

            pd.Timestamp("2016-05-25 13:30:00.072"),

            pd.Timestamp("2016-05-25 13:30:00.075")

        ],

        "ticker": [

               "GOOG",

               "MSFT",

               "MSFT",

               "MSFT",

               "GOOG",

               "AAPL",

               "GOOG",

               "MSFT"

           ],

           "bid": [720.50, 51.95, 51.97, 51.99, 720.50, 97.99, 720.50, 52.01],

           "ask": [720.93, 51.96, 51.98, 52.00, 720.93, 98.01, 720.88, 52.03]

    }

)

In [46]:
quotes

                     time ticker     bid     ask
0 2016-05-25 13:30:00.023   GOOG  720.50  720.93
1 2016-05-25 13:30:00.023   MSFT   51.95   51.96
2 2016-05-25 13:30:00.030   MSFT   51.97   51.98
3 2016-05-25 13:30:00.041   MSFT   51.99   52.00
4 2016-05-25 13:30:00.048   GOOG  720.50  720.93
5 2016-05-25 13:30:00.049   AAPL   97.99   98.01
6 2016-05-25 13:30:00.072   GOOG  720.50  720.88
7 2016-05-25 13:30:00.075   MSFT   52.01   52.03

In [47]:
trades = pd.DataFrame(

       {

           "time": [

               pd.Timestamp("2016-05-25 13:30:00.023"),

               pd.Timestamp("2016-05-25 13:30:00.038"),

               pd.Timestamp("2016-05-25 13:30:00.048"),

               pd.Timestamp("2016-05-25 13:30:00.048"),

               pd.Timestamp("2016-05-25 13:30:00.048")

           ],

           "ticker": ["MSFT", "MSFT", "GOOG", "GOOG", "AAPL"],

           "price": [51.95, 51.95, 720.77, 720.92, 98.0],

           "quantity": [75, 155, 100, 100, 100]

       }

   )

In [48]:
trades

                     time ticker   price  quantity
0 2016-05-25 13:30:00.023   MSFT   51.95        75
1 2016-05-25 13:30:00.038   MSFT   51.95       155
2 2016-05-25 13:30:00.048   GOOG  720.77       100
3 2016-05-25 13:30:00.048   GOOG  720.92       100
4 2016-05-25 13:30:00.048   AAPL   98.00       100

In [49]:
pd.merge_asof(trades, quotes, on='time', by='ticker')

                     time ticker   price  quantity     bid     ask
0 2016-05-25 13:30:00.023   MSFT   51.95        75   51.95   51.96
1 2016-05-25 13:30:00.038   MSFT   51.95       155   51.97   51.98
2 2016-05-25 13:30:00.048   GOOG  720.77       100  720.50  720.93
3 2016-05-25 13:30:00.048   GOOG  720.92       100  720.50  720.93
4 2016-05-25 13:30:00.048   AAPL   98.00       100     NaN     NaN

In [50]:
pd.merge_asof(

    trades, quotes, on="time", by="ticker", tolerance=pd.Timedelta("2ms")

)

                     time ticker   price  quantity     bid     ask
0 2016-05-25 13:30:00.023   MSFT   51.95        75   51.95   51.96
1 2016-05-25 13:30:00.038   MSFT   51.95       155     NaN     NaN
2 2016-05-25 13:30:00.048   GOOG  720.77       100  720.50  720.93
3 2016-05-25 13:30:00.048   GOOG  720.92       100  720.50  720.93
4 2016-05-25 13:30:00.048   AAPL   98.00       100     NaN     NaN

# pd.concat

In [51]:
s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])

In [52]:
s1

0    a
1    b
dtype: object

In [53]:
s2

0    c
1    d
dtype: object

In [54]:
pd.concat([s1,s2])

0    a
1    b
0    c
1    d
dtype: object

In [56]:
pd.concat([s1,s2], axis ='rows', ignore_index = True)

0    a
1    b
2    c
3    d
dtype: object

In [57]:
pd.concat([s1,s2], keys=['s1', 's2'])

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [58]:
pd.concat([s1,s2], keys=['s1', 's2'], names = ['Series Name', 'Row ID'])

Series Name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

In [59]:
df1 = pd.DataFrame([['a', 1], ['b', 2]], columns = ['letter', 'number'])
df1

  letter  number
0      a       1
1      b       2

In [61]:
df2 = pd.DataFrame([['c', 3], ['d', 4]], columns = ['letter', 'number'])
df2

  letter  number
0      c       3
1      d       4

In [62]:
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [63]:
pd.concat([df1, df2], ignore_index=True)

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4

In [65]:
pd.concat([df1, df2],keys = ['df1', 'df2'])

      letter  number
df1 0      a       1
    1      b       2
df2 0      c       3
    1      d       4

In [67]:
pd.concat([df1, df2],keys = ['df1', 'df2'], names = ['DataFrame','Row ID'])

                 letter  number
DataFrame Row ID
df1       0           a       1
          1           b       2
df2       0           c       3
          1           d       4

In [69]:
df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']], 
                  columns = ['letter', 'number', 'animal'])
df3

  letter  number animal
0      c       3    cat
1      d       4    dog

In [70]:
df1

  letter  number
0      a       1
1      b       2

In [73]:
pd.concat([df1,df3], sort=False)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [74]:
pd.concat([df1, df3], join='inner')

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [75]:
df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']], columns =['animal', 'name'])
df4

   animal    name
0    bird   polly
1  monkey  george

In [76]:
df1

  letter  number
0      a       1
1      b       2

In [78]:
pd.concat([df1, df4], axis = 1)

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

In [80]:
pd.concat([df1, df4], axis = 'columns')

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

# pd.melt

In [81]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},

                   'B': {0: 1, 1: 3, 2: 5},

                   'C': {0: 2, 1: 4, 2: 6}})

In [82]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [83]:
pd.melt(df, id_vars = ['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [84]:
pd.melt(df, id_vars = ['A'], value_vars = ['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [85]:
pd.melt(df, id_vars = ['A'], value_vars = ['B'], var_name = 'myVarname', value_name='myValname')

   A myVarname  myValname
0  a         B          1
1  b         B          3
2  c         B          5

In [86]:
pd.melt(df, id_vars = ['A'], value_vars = ['B', 'C'], ignore_index = False)

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
0  a        C      2
1  b        C      4
2  c        C      6

In [87]:
df.columns = [list('ABC'), list('DEF')]

In [88]:
df

   A  B  C
   D  E  F
0  a  1  2
1  b  3  4
2  c  5  6

In [89]:
pd.melt(df, col_level = 0, id_vars = ['A'], value_vars = ['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [91]:
pd.melt(df, id_vars = [('A', 'D')], value_vars = [('B', 'E')])

  (A, D) variable_0 variable_1  value
0      a          B          E      1
1      b          B          E      3
2      c          B          E      5

# pd.pivot

In [92]:
df = pd.DataFrame({
    'foo': ['one', 'one', 'one', 'two', 'two', 'two'], 
    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
    'baz': [1,2,3,4,5,6], 
    'zoo': ['x','y', 'z', 'q', 'w', 't']
})
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [94]:
df.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [95]:
df.pivot(index='foo', columns = 'bar', values=['baz', 'zoo'])

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t

In [96]:
df = pd.DataFrame({

       "lev1": [1, 1, 1, 2, 2, 2],

       "lev2": [1, 1, 2, 1, 1, 2],

       "lev3": [1, 2, 1, 2, 1, 2],

       "lev4": [1, 2, 3, 4, 5, 6],

       "values": [0, 1, 2, 3, 4, 5]})
df

   lev1  lev2  lev3  lev4  values
0     1     1     1     1       0
1     1     1     2     2       1
2     1     2     1     3       2
3     2     1     2     4       3
4     2     1     1     5       4
5     2     2     2     6       5

In [97]:
df.pivot(index='lev1', columns=['lev2', 'lev3'], values='values')

lev2    1         2
lev3    1    2    1    2
lev1
1     0.0  1.0  2.0  NaN
2     4.0  3.0  NaN  5.0

In [98]:
df.pivot(index=['lev1', 'lev2'], columns =['lev3'], values='values')

lev3         1    2
lev1 lev2
1    1     0.0  1.0
     2     2.0  NaN
2    1     4.0  3.0
     2     NaN  5.0

# pd.pivot_table

In [100]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",

                         "bar", "bar", "bar", "bar"],

                   "B": ["one", "one", "one", "two", "two",

                         "one", "one", "two", "two"],

                   "C": ["small", "large", "large", "small",

                         "small", "large", "small", "small",

                         "large"],

                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],

                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [101]:
table = pd.pivot_table(df, values='D', index=['A', 'B'], columns = ['C'], aggfunc=np.sum)

In [102]:
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [104]:
table = pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'], aggfunc=np.sum, fill_value=0)
table

C        large  small
A   B
bar one      4      5
    two      7      6
foo one      4      1
    two      0      6

In [105]:
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'], aggfunc={'D': np.mean, 'E': np.mean})
table

                  D         E
A   C
bar large  5.500000  7.500000
    small  5.500000  8.500000
foo large  2.000000  4.500000
    small  2.333333  4.333333

In [106]:
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'], aggfunc = {'D': np.mean, 'E': [min, max, np.mean]})
table

                  D    E
               mean  max      mean  min
A   C
bar large  5.500000  9.0  7.500000  6.0
    small  5.500000  9.0  8.500000  8.0
foo large  2.000000  5.0  4.500000  4.0
    small  2.333333  6.0  4.333333  2.0

# pd.crosstab

In [107]:
a = np.array(["foo", "foo", "foo", "foo", "bar", "bar",

              "bar", "bar", "foo", "foo", "foo"], dtype=object)

b = np.array(["one", "one", "one", "two", "one", "one",

              "one", "two", "two", "two", "one"], dtype=object)

c = np.array(["dull", "dull", "shiny", "dull", "dull", "shiny",

              "shiny", "dull", "shiny", "shiny", "shiny"],

             dtype=object)

In [108]:
a

array(['foo', 'foo', 'foo', 'foo', 'bar', 'bar', 'bar', 'bar', 'foo',
       'foo', 'foo'], dtype=object)

In [109]:
b

array(['one', 'one', 'one', 'two', 'one', 'one', 'one', 'two', 'two',
       'two', 'one'], dtype=object)

In [110]:
c

array(['dull', 'dull', 'shiny', 'dull', 'dull', 'shiny', 'shiny', 'dull',
       'shiny', 'shiny', 'shiny'], dtype=object)

In [111]:
pd.crosstab(a, [b,c], rownames=['a'], colnames=['b','c'])

b    one        two
c   dull shiny dull shiny
a
bar    1     2    1     0
foo    2     2    1     2

In [112]:
foo = pd.Categorical(['a', 'b'], categories=['a', 'b', 'c'])

bar = pd.Categorical(['d', 'e'], categories=['d', 'e', 'f'])

In [113]:
foo

['a', 'b']
Categories (3, object): ['a', 'b', 'c']

In [114]:
bar

['d', 'e']
Categories (3, object): ['d', 'e', 'f']

In [115]:
pd.crosstab(foo,bar)

col_0  d  e
row_0
a      1  0
b      0  1

# pd.DataFrame.iloc

In [116]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},

          {'a': 100, 'b': 200, 'c': 300, 'd': 400},

          {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]

df = pd.DataFrame(mydict)
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [117]:
df.iloc[0]

a    1
b    2
c    3
d    4
Name: 0, dtype: int64

In [122]:
df.iloc[[0]]

   a  b  c  d
0  1  2  3  4

In [123]:
df.iloc[[0],[3]]

   d
0  4

In [126]:
df.iloc[lambda x: x.index%2==0]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [127]:
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [129]:
df.iloc[:, [True, False,True, False]]

      a     c
0     1     3
1   100   300
2  1000  3000

In [130]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [131]:
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [132]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['a', 'b', 'c', 'd'], dtype='object')]

# pd.DataFrame.assign

In [133]:
df = pd.DataFrame({'temp_c': [17.0, 25.0]},

                  index=['Portland', 'Berkeley'])
df

          temp_c
Portland    17.0
Berkeley    25.0

In [136]:
df.assign(temp_f=lambda x: x.temp_c * 9 / 5 + 32)

          temp_c  temp_f
Portland    17.0    62.6
Berkeley    25.0    77.0

In [137]:
df.assign(temp_f=df['temp_c'] * 9 / 5 + 32)

          temp_c  temp_f
Portland    17.0    62.6
Berkeley    25.0    77.0

In [138]:
df.assign(temp_f=lambda x: x['temp_c'] * 9 / 5 + 32,

          temp_k=lambda x: (x['temp_f'] +  459.67) * 5 / 9)

          temp_c  temp_f  temp_k
Portland    17.0    62.6  290.15
Berkeley    25.0    77.0  298.15

# pd.DataFrame.astype

In [140]:
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data = d)
df

   col1  col2
0     1     3
1     2     4

In [141]:
df.dtypes

col1    int64
col2    int64
dtype: object

In [143]:
df.astype('int32').dtypes

col1    int32
col2    int32
dtype: object

In [144]:
df.astype({'col1': 'int32'}).dtypes

col1    int32
col2    int64
dtype: object

# pd.DataFrame.clip

In [147]:
data = {'col_0': [9, -3, 0, -1, 5], 'col_1': [-2, -7, 6, 8, -5]}

df = pd.DataFrame(data)
df

   col_0  col_1
0      9     -2
1     -3     -7
2      0      6
3     -1      8
4      5     -5

In [148]:
df.clip(-4,6)

   col_0  col_1
0      6     -2
1     -3     -4
2      0      6
3     -1      6
4      5     -4

In [149]:
t = pd.Series([2, -4, -1, 6, 3])
t

0    2
1   -4
2   -1
3    6
4    3
dtype: int64

In [150]:
df

   col_0  col_1
0      9     -2
1     -3     -7
2      0      6
3     -1      8
4      5     -5

In [151]:
df.clip(t, t + 4, axis=0)

   col_0  col_1
0      6      2
1     -3     -4
2      0      3
3      6      8
4      5      3

# pd.DataFrame.copy

In [152]:
s = pd.Series([1, 2], index=["a", "b"])

deep = s.copy()

shallow = s.copy(deep=False)

In [154]:
s is shallow

False

In [155]:
s.values is shallow.values and s.index is shallow.index

True

In [156]:
s is deep

False

In [158]:
s.values is deep.values and s.index is deep.index

False

In [159]:
s[0] = 3

shallow[1] = 4

In [160]:
s

a    3
b    4
dtype: int64

In [161]:
shallow

a    3
b    4
dtype: int64

In [162]:
deep

a    1
b    2
dtype: int64

# pd.Dataframe.filter

In [166]:
df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6])),

                  index=['mouse', 'rabbit'],

                  columns=['one', 'two', 'three'])

df

        one  two  three
mouse     1    2      3
rabbit    4    5      6

In [167]:
df.filter(items=['one', 'three'])

        one  three
mouse     1      3
rabbit    4      6

In [168]:
df.filter(regex='e$', axis=1)

        one  three
mouse     1      3
rabbit    4      6

In [169]:
df.filter(like='bbi', axis=0)

        one  two  three
rabbit    4    5      6

# pd.DataFrame.idxmax

In [170]:
df = pd.DataFrame({'consumption': [10.51, 103.11, 55.48],

                   'co2_emissions': [37.2, 19.66, 1712]},

                   index=['Pork', 'Wheat Products', 'Beef'])
df

                consumption  co2_emissions
Pork                  10.51          37.20
Wheat Products       103.11          19.66
Beef                  55.48        1712.00

In [171]:
df.idxmax()

consumption      Wheat Products
co2_emissions              Beef
dtype: object

In [175]:
df.loc['Wheat Products', 'consumption']

103.11

In [176]:
df.loc['Beef', 'co2_emissions']

1712.0

In [177]:
df.idxmax(axis='columns')

Pork              co2_emissions
Wheat Products      consumption
Beef              co2_emissions
dtype: object